Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_spi.h
/**
 *******************************************************************************************************
 * @file    fm33ht0xxa_fl_spi.h
 * @author  FMSH Application Team
 * @brief   Head file of SPI FL Module
 *******************************************************************************************************
 * @attention    
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *        
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *    
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors 
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *    
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE   
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.    
  *
 *******************************************************************************************************
 */

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33HT0XXA_FL_SPI_H
#define __FM33HT0XXA_FL_SPI_H

#ifdef __cplusplus
extern "C"
{
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33ht0xxa_fl_def.h"
  /** @addtogroup FM33HT0XXA_FL_Driver
   * @{
   */
  /* Exported types -------------------------------------------------------------------------------------*/
  /** @defgroup SPI_FL_ES_INIT SPI Exported Init structures
   * @{
   */

  /**
   * @brief FL SPI Init Sturcture definition
   */
  typedef struct
  {
    /*! 传输模式 单双工 */
    uint32_t transferMode;
    /*! 主从模式 */
    uint32_t mode;
    /*! 数据位宽 */
    uint32_t dataWidth;
    /*! 时钟极性 */
    uint32_t clockPolarity;
    /*! 时钟相位 */
    uint32_t clockPhase;
    /*! NSS 脚使能软件控制 */
    uint32_t softControl;
    /*! 通讯速率 */
    uint32_t baudRate;
    /*! Bit方向 */
    uint32_t bitOrder;

  } FL_SPI_InitTypeDef;

  typedef struct
  {
    /*! I2S主从机模式 */
    uint32_t mode;
    /*! I2S标准选择*/
    uint32_t standard;
    /*! I2S通信长度*/
    uint32_t dataFormat;
    /*! I2S_MCLK输出使能*/
    FL_FunState mclkOutput;
    /*! I2S_音频采样频率*/
    uint32_t audioFreq;
    /*! I2S空闲时钟极性*/
    uint32_t clockPolarity;

  } FL_I2S_InitTypeDef;

#define FL_I2S_DATAFORMAT_16B 0x00000000U
#define FL_I2S_DATAFORMAT_16B_EXTENDED (FL_I2S_VOCAL_TRACT_LENGTH_32BITS)
#define FL_I2S_DATAFORMAT_24B (FL_I2S_VOCAL_TRACT_LENGTH_32BITS | FL_I2S_DATA_LENGTH_24BITS)
#define FL_I2S_DATAFORMAT_32B (FL_I2S_VOCAL_TRACT_LENGTH_32BITS | FL_I2S_DATA_LENGTH_32BITS)

#define FL_I2S_AUDIOFREQ_192K 192000U
#define FL_I2S_AUDIOFREQ_96K 96000U
#define FL_I2S_AUDIOFREQ_48K 48000U
#define FL_I2S_AUDIOFREQ_44K 44100U
#define FL_I2S_AUDIOFREQ_32K 32000U
#define FL_I2S_AUDIOFREQ_22K 22050U
#define FL_I2S_AUDIOFREQ_16K 16000U
#define FL_I2S_AUDIOFREQ_11K 11025U
#define FL_I2S_AUDIOFREQ_8K 8000U

#define FL_I2S_STANDARD_PHILIPS FL_I2S_STANDARD_MODE_PHILIPS
#define FL_I2S_STANDARD_MSB FL_I2S_STANDARD_MODE_MSB_JUSTIFIED
#define FL_I2S_STANDARD_LSB FL_I2S_STANDARD_MODE_LSB_JUSTIFIED
#define FL_I2S_STANDARD_PCM_SHORT (FL_I2S_STANDARD_MODE_PCM)
#define FL_I2S_STANDARD_PCM_LONG (FL_I2S_STANDARD_MODE_PCM | FL_I2S_FRAME_SYNCHRONIZATION_LONG)

  /**
   * @}
   */
  /* Exported constants ---------------------------------------------------------------------------------*/
  /** @defgroup SPI_FL_Exported_Constants SPI Exported Constants
   * @{
   */

#define SPI_CR1_IOSWAP_Pos (11U)
#define SPI_CR1_IOSWAP_Msk (0x1U << SPI_CR1_IOSWAP_Pos)
#define SPI_CR1_IOSWAP SPI_CR1_IOSWAP_Msk

#define SPI_CR1_MSPA_Pos (10U)
#define SPI_CR1_MSPA_Msk (0x1U << SPI_CR1_MSPA_Pos)
#define SPI_CR1_MSPA SPI_CR1_MSPA_Msk

#define SPI_CR1_SSPA_Pos (9U)
#define SPI_CR1_SSPA_Msk (0x1U << SPI_CR1_SSPA_Pos)
#define SPI_CR1_SSPA SPI_CR1_SSPA_Msk

#define SPI_CR1_MM_Pos (8U)
#define SPI_CR1_MM_Msk (0x1U << SPI_CR1_MM_Pos)
#define SPI_CR1_MM SPI_CR1_MM_Msk

#define SPI_CR1_WAIT_Pos (6U)
#define SPI_CR1_WAIT_Msk (0x3U << SPI_CR1_WAIT_Pos)
#define SPI_CR1_WAIT SPI_CR1_WAIT_Msk

#define SPI_CR1_BAUD_Pos (3U)
#define SPI_CR1_BAUD_Msk (0x7U << SPI_CR1_BAUD_Pos)
#define SPI_CR1_BAUD SPI_CR1_BAUD_Msk

#define SPI_CR1_LSBF_Pos (2U)
#define SPI_CR1_LSBF_Msk (0x1U << SPI_CR1_LSBF_Pos)
#define SPI_CR1_LSBF SPI_CR1_LSBF_Msk

#define SPI_CR1_CPOL_Pos (1U)
#define SPI_CR1_CPOL_Msk (0x1U << SPI_CR1_CPOL_Pos)
#define SPI_CR1_CPOL SPI_CR1_CPOL_Msk

#define SPI_CR1_CPHA_Pos (0U)
#define SPI_CR1_CPHA_Msk (0x1U << SPI_CR1_CPHA_Pos)
#define SPI_CR1_CPHA SPI_CR1_CPHA_Msk

#define SPI_CR2_DUMMY_EN_Pos (15U)
#define SPI_CR2_DUMMY_EN_Msk (0x1U << SPI_CR2_DUMMY_EN_Pos)
#define SPI_CR2_DUMMY_EN SPI_CR2_DUMMY_EN_Msk

#define SPI_CR2_DLEN2_Pos (12U)
#define SPI_CR2_DLEN2_Msk (0x7U << SPI_CR2_DLEN2_Pos)
#define SPI_CR2_DLEN2 SPI_CR2_DLEN2_Msk

#define SPI_CR2_DLEN_Pos (9U)
#define SPI_CR2_DLEN_Msk (0x3U << SPI_CR2_DLEN_Pos)
#define SPI_CR2_DLEN SPI_CR2_DLEN_Msk

#define SPI_CR2_RXO_Pos (11U)
#define SPI_CR2_RXO_Msk (0x1U << SPI_CR2_RXO_Pos)
#define SPI_CR2_RXO SPI_CR2_RXO_Msk

#define SPI_CR2_HALFDUPLEX_Pos (8U)
#define SPI_CR2_HALFDUPLEX_Msk (0x1U << SPI_CR2_HALFDUPLEX_Pos)
#define SPI_CR2_HALFDUPLEX SPI_CR2_HALFDUPLEX_Msk

#define SPI_CR2_HD_RW_Pos (7U)
#define SPI_CR2_HD_RW_Msk (0x1U << SPI_CR2_HD_RW_Pos)
#define SPI_CR2_HD_RW SPI_CR2_HD_RW_Msk

#define SPI_CR2_CMD8B_Pos (6U)
#define SPI_CR2_CMD8B_Msk (0x1U << SPI_CR2_CMD8B_Pos)
#define SPI_CR2_CMD8B SPI_CR2_CMD8B_Msk

#define SPI_CR2_SSNM_Pos (5U)
#define SPI_CR2_SSNM_Msk (0x1U << SPI_CR2_SSNM_Pos)
#define SPI_CR2_SSNM SPI_CR2_SSNM_Msk

#define SPI_CR2_TXO_AC_Pos (4U)
#define SPI_CR2_TXO_AC_Msk (0x1U << SPI_CR2_TXO_AC_Pos)
#define SPI_CR2_TXO_AC SPI_CR2_TXO_AC_Msk

#define SPI_CR2_TXO_Pos (3U)
#define SPI_CR2_TXO_Msk (0x1U << SPI_CR2_TXO_Pos)
#define SPI_CR2_TXO SPI_CR2_TXO_Msk

