Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_spi.h
    return datawith;
  }

  /**
   * @brief    Enable SPI Receive Only Mode
   * @rmtoll   CR2    RXO    FL_SPI_EnableRXOnlyMode
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_EnableRXOnlyMode(SPI_Type *SPIx)
  {
    SET_BIT(SPIx->CR2, SPI_CR2_RXO_Msk);
  }

  /**
   * @brief    Disable SPI Receive Only Mode Setting
   * @rmtoll   CR2    RXO    FL_SPI_DisableRXOnlyMode
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_DisableRXOnlyMode(SPI_Type *SPIx)
  {
    CLEAR_BIT(SPIx->CR2, SPI_CR2_RXO_Msk);
  }

  /**
   * @brief    Get SPI Receive Only Mode state
   * @rmtoll   CR2    RXO    FL_SPI_IsEnabledRXOnlyMode
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsEnabledRXOnlyMode(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_RXO_Msk) == SPI_CR2_RXO_Msk);
  }

  /**
   * @brief    Set SPI Transfer Mode
   * @rmtoll   CR2    HALFDUPLEX    FL_SPI_SetTransferMode
   * @param    SPIx SPI instance
   * @param    mode This parameter can be one of the following values:
   *           @arg @ref FL_SPI_TRANSFER_MODE_FULL_DUPLEX
   *           @arg @ref FL_SPI_TRANSFER_MODE_HALF_DUPLEX
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetTransferMode(SPI_Type *SPIx, uint32_t mode)
  {
    MODIFY_REG(SPIx->CR2, SPI_CR2_HALFDUPLEX_Msk, mode);
  }

  /**
   * @brief    Get SPI Transfer Mode
   * @rmtoll   CR2    HALFDUPLEX    FL_SPI_GetTransferMode
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_TRANSFER_MODE_FULL_DUPLEX
   *           @arg @ref FL_SPI_TRANSFER_MODE_HALF_DUPLEX
   */
  __STATIC_INLINE uint32_t FL_SPI_GetTransferMode(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_HALFDUPLEX_Msk));
  }

  /**
   * @brief    Set SPI Transfer Direction Under Half-Duplex Mode
   * @rmtoll   CR2    HD_RW    FL_SPI_SetTransferDirection
   * @param    SPIx SPI instance
   * @param    direction This parameter can be one of the following values:
   *           @arg @ref FL_SPI_HALF_DUPLEX_TX
   *           @arg @ref FL_SPI_HALF_DUPLEX_RX
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetTransferDirection(SPI_Type *SPIx, uint32_t direction)
  {
    MODIFY_REG(SPIx->CR2, SPI_CR2_HD_RW_Msk, direction);
  }

  /**
   * @brief    Get SPI Transfer Direction Under Half-Duplex Mode
   * @rmtoll   CR2    HD_RW    FL_SPI_GetTransferDirection
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_HALF_DUPLEX_TX
   *           @arg @ref FL_SPI_HALF_DUPLEX_RX
   */
  __STATIC_INLINE uint32_t FL_SPI_GetTransferDirection(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_HD_RW_Msk));
  }

  /**
   * @brief    Set Command Frame Length Under Half-Duplex Mode
   * @rmtoll   CR2    CMD8B    FL_SPI_SetHalfDuplexCommandLength
   * @param    SPIx SPI instance
   * @param    mode This parameter can be one of the following values:
   *           @arg @ref FL_SPI_HALF_DUPLEX_CMDLEN_DLEN
   *           @arg @ref FL_SPI_HALF_DUPLEX_CMDLEN_8B
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetHalfDuplexCommandLength(SPI_Type *SPIx, uint32_t mode)
  {
    MODIFY_REG(SPIx->CR2, SPI_CR2_CMD8B_Msk, mode);
  }

  /**
   * @brief    Get Command Frame Length Under Half-Duplex Mode
   * @rmtoll   CR2    CMD8B    FL_SPI_GetHalfDuplexCommandLength
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_HALFDUPLEX_CMDLEN_DLEN
   *           @arg @ref FL_SPI_HALFDUPLEX_CMDLEN_8B
   */
  __STATIC_INLINE uint32_t FL_SPI_GetHalfDuplexCommandLength(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_CMD8B_Msk));
  }

  /**
   * @brief    Set SPI SSN Hard Pin Mode
   * @rmtoll   CR2    SSNM    FL_SPI_SetHardwareSSNMode
   * @param    SPIx SPI instance
   * @param    mode This parameter can be one of the following values:
   *           @arg @ref FL_SPI_HARDWARE_SSN_KEEP_LOW
   *           @arg @ref FL_SPI_HARDWARE_SSN_AUTO_HIGH
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetHardwareSSNMode(SPI_Type *SPIx, uint32_t mode)
  {
    MODIFY_REG(SPIx->CR2, SPI_CR2_SSNM_Msk, mode);
  }

  /**
   * @brief    Get SPI SSN Hard Pin Mode
   * @rmtoll   CR2    SSNM    FL_SPI_GetHardwareSSNMode
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_HARDWARE_SSN_KEEP_LOW
   *           @arg @ref FL_SPI_HARDWARE_SSN_AUTO_HIGH
   */
  __STATIC_INLINE uint32_t FL_SPI_GetHardwareSSNMode(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_SSNM_Msk));
  }

  /**
   * @brief    Enabel TX Only Mode Auto Clear
   * @rmtoll   CR2    TXO_AC    FL_SPI_EnableTXOnlyModeAutoClear
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_EnableTXOnlyModeAutoClear(SPI_Type *SPIx)
  {
    SET_BIT(SPIx->CR2, SPI_CR2_TXO_AC_Msk);
  }

  /**
   * @brief    Disable TX Only Mode Auto Clear
   * @rmtoll   CR2    TXO_AC    FL_SPI_DisableTXOnlyModeAutoClear
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_DisableTXOnlyModeAutoClear(SPI_Type *SPIx)
  {
    CLEAR_BIT(SPIx->CR2, SPI_CR2_TXO_AC_Msk);
  }

  /**
   * @brief    Get TX Only Mode Auto Clear Setting
   * @rmtoll   CR2    TXO_AC    FL_SPI_IsEnabledTXOnlyModeAutoClear
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsEnabledTXOnlyModeAutoClear(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_TXO_AC_Msk) == SPI_CR2_TXO_AC_Msk);
  }

  /**
   * @brief    EnableSPI TX Only Mode
   * @rmtoll   CR2    TXO    FL_SPI_EnableTXOnlyMode
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_EnableTXOnlyMode(SPI_Type *SPIx)
  {
    SET_BIT(SPIx->CR2, SPI_CR2_TXO_Msk);
  }

  /**
   * @brief    DisableSPI TX Only Mode
   * @rmtoll   CR2    TXO    FL_SPI_DisableTXOnlyMode
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_DisableTXOnlyMode(SPI_Type *SPIx)
  {
    CLEAR_BIT(SPIx->CR2, SPI_CR2_TXO_Msk);
  }

  /**
   * @brief    Get SPI TX Only Mode Setting State
   * @rmtoll   CR2    TXO    FL_SPI_IsEnabledTXOnlyMode
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsEnabledTXOnlyMode(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_TXO_Msk) == SPI_CR2_TXO_Msk);
  }

  /**
   * @brief    Set SSN Pin
   * @rmtoll   CR2    SSN    FL_SPI_SetSSNPin
   * @param    SPIx SPI instance
   * @param    state This parameter can be one of the following values:
   *           @arg @ref FL_SPI_SSN_LOW
   *           @arg @ref FL_SPI_SSN_HIGH
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetSSNPin(SPI_Type *SPIx, uint32_t state)
  {
    MODIFY_REG(SPIx->CR2, SPI_CR2_SSN_Msk, state);
  }

  /**
   * @brief    Reset SSN Pin
   * @rmtoll   CR2    SSN    FL_SPI_GetSSNPin
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_SSN_LOW
   *           @arg @ref FL_SPI_SSN_HIGH
   */
  __STATIC_INLINE uint32_t FL_SPI_GetSSNPin(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_SSN_Msk));
  }

  /**
   * @brief    Enable SNN Sofe Control Under Master Mode
   * @rmtoll   CR2    SSNSEN    FL_SPI_EnableSSNSoftControl
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_EnableSSNSoftControl(SPI_Type *SPIx)
  {
    SET_BIT(SPIx->CR2, SPI_CR2_SSNSEN_Msk);
  }

  /**
   * @brief    Get SNN Sofe Control State Under Master Mode
   * @rmtoll   CR2    SSNSEN    FL_SPI_IsEnabledSSNSoftControl
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsEnabledSSNSoftControl(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_SSNSEN_Msk) == SPI_CR2_SSNSEN_Msk);
  }

  /**
   * @brief    Disable SNN Sofe Control Under Master Mode
   * @rmtoll   CR2    SSNSEN    FL_SPI_DisableSSNSoftControl
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_DisableSSNSoftControl(SPI_Type *SPIx)
  {
    CLEAR_BIT(SPIx->CR2, SPI_CR2_SSNSEN_Msk);
  }

  /**
   * @brief    Enable SPI
   * @rmtoll   CR2    SPIEN    FL_SPI_Enable
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_Enable(SPI_Type *SPIx)
  {
    SET_BIT(SPIx->CR2, SPI_CR2_SPIEN_Msk);
  }

  /**
   * @brief    Get SPI Enable Status
   * @rmtoll   CR2    SPIEN    FL_SPI_IsEnabled
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsEnabled(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_SPIEN_Msk) == SPI_CR2_SPIEN_Msk);
  }

  /**
   * @brief    Disable SPI
   * @rmtoll   CR2    SPIEN    FL_SPI_Disable
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_Disable(SPI_Type *SPIx)
  {
    CLEAR_BIT(SPIx->CR2, SPI_CR2_SPIEN_Msk);
  }

  /**
   * @brief    Read SPI TX Buffer
   * @rmtoll   CR3    TXBFC    FL_SPI_GetTXBuffState
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   */
  __STATIC_INLINE uint32_t FL_SPI_GetTXBuffState(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR3, SPI_CR3_TXBFC_Msk));
  }

  /**
   * @brief    Clear SPI TX Buffer
   * @rmtoll   CR3    TXBFC    FL_SPI_ClearTXBuff
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_ClearTXBuff(SPI_Type *SPIx)
  {
    WRITE_REG(SPIx->CR3, SPI_CR3_TXBFC_Msk);
  }

  /**
   * @brief    Read SPI RX Buffer
   * @rmtoll   CR3    RXBFC    FL_SPI_GetRXBuffState
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   */
  __STATIC_INLINE uint32_t FL_SPI_GetRXBuffState(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR3, SPI_CR3_RXBFC_Msk));
  }

  /**
   * @brief    Clear SPI RX Buffer
   * @rmtoll   CR3    RXBFC    FL_SPI_ClearRXBuff
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_ClearRXBuff(SPI_Type *SPIx)
  {
    WRITE_REG(SPIx->CR3, SPI_CR3_RXBFC_Msk);
  }

  /**
   * @brief    Read SPI Master Error Flag
   * @rmtoll   CR3    MERRC    FL_SPI_GetMasterError
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   */
  __STATIC_INLINE uint32_t FL_SPI_GetMasterError(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR3, SPI_CR3_MERRC_Msk));
  }

  /**
   * @brief    Clear SPI Master Error Flag
   * @rmtoll   CR3    MERRC    FL_SPI_ClearFlag_MasterError
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_ClearFlag_MasterError(SPI_Type *SPIx)
  {
    WRITE_REG(SPIx->CR3, SPI_CR3_MERRC_Msk);
  }

  /**
   * @brief    Read SPI Slave Error Flag
   * @rmtoll   CR3    SERRC    FL_SPI_GetSlaveError
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   */
  __STATIC_INLINE uint32_t FL_SPI_GetSlaveError(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR3, SPI_CR3_SERRC_Msk));
  }

  /**
   * @brief    Clear SPI Slave Error Flag
   * @rmtoll   CR3    SERRC    FL_SPI_ClearFlag_SlaveError
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_ClearFlag_SlaveError(SPI_Type *SPIx)
  {
    WRITE_REG(SPIx->CR3, SPI_CR3_SERRC_Msk);
  }

  /**
   * @brief    Disable SPI Slave SSN Rise Interrupt
   * @rmtoll   IER    SSNRIE    FL_SPI_DisableIT_SlaveSSNRise
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_DisableIT_SlaveSSNRise(SPI_Type *SPIx)
  {
    CLEAR_BIT(SPIx->IER, SPI_IER_SSNRIE_Msk);
  }

  /**
   * @brief    Enable SPI Slave SSN Rise Interrupt
   * @rmtoll   IER    SSNRIE    FL_SPI_EnableIT_SlaveSSNRise
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_EnableIT_SlaveSSNRise(SPI_Type *SPIx)
  {
    SET_BIT(SPIx->IER, SPI_IER_SSNRIE_Msk);
  }

  /**
   * @brief    Get SPI Slave SSN Rise Interrupt Enable Status
   * @rmtoll   IER    SSNRIE    FL_SPI_IsEnabledIT_SlaveSSNRise
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsEnabledIT_SlaveSSNRise(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->IER, SPI_IER_SSNRIE_Msk) == SPI_IER_SSNRIE_Msk);
  }

  /**
   * @brief    Disable SPI Slave SSN Fall Interrupt
   * @rmtoll   IER    SSNFIE    FL_SPI_DisableIT_SlaveSSNFall
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_DisableIT_SlaveSSNFall(SPI_Type *SPIx)
  {
    CLEAR_BIT(SPIx->IER, SPI_IER_SSNFIE_Msk);
  }

  /**
   * @brief    Enable SPI Slave SSN Fall Interrupt
   * @rmtoll   IER    SSNFIE    FL_SPI_EnableIT_SlaveSSNFall
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_EnableIT_SlaveSSNFall(SPI_Type *SPIx)
  {
    SET_BIT(SPIx->IER, SPI_IER_SSNFIE_Msk);
  }

  /**
   * @brief    Get SPI Slave SSN Fall Interrupt Enable Status
   * @rmtoll   IER    SSNFIE    FL_SPI_IsEnabledIT_SlaveSSNFall
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsEnabledIT_SlaveSSNFall(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->IER, SPI_IER_SSNFIE_Msk) == SPI_IER_SSNFIE_Msk);
  }

  /**
   * @brief    Disable SPI Transmit Shift Empty Interrupt
   * @rmtoll   IER    TXSEIE    FL_SPI_DisableIT_TXShiftEmptyComplete
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_DisableIT_TXShiftEmptyComplete(SPI_Type *SPIx)
  {
    CLEAR_BIT(SPIx->IER, SPI_IER_TXSEIE_Msk);
  }

  /**
   * @brief    Enable SPI Transmit Shift Empty Interrupt
   * @rmtoll   IER    TXSEIE    FL_SPI_EnableIT_TXShiftEmptyComplete
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_EnableIT_TXShiftEmptyComplete(SPI_Type *SPIx)
  {
    SET_BIT(SPIx->IER, SPI_IER_TXSEIE_Msk);
  }

  /**
   * @brief    Get SPI Transmit Shift Empty Interrupt Enable Status
   * @rmtoll   IER    TXSEIE    FL_SPI_IsEnabledIT_TXShiftEmptyComplete
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsEnabledIT_TXShiftEmptyComplete(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->IER, SPI_IER_TXSEIE_Msk) == SPI_IER_TXSEIE_Msk);
  }

  /**
   * @brief    Disable SPI Error Interrupt
   * @rmtoll   IER    ERRIE    FL_SPI_DisableIT_Error
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_DisableIT_Error(SPI_Type *SPIx)
  {
    CLEAR_BIT(SPIx->IER, SPI_IER_ERRIE_Msk);
  }

  /**
   * @brief    Enable SPI Error Interrupt
   * @rmtoll   IER    ERRIE    FL_SPI_EnableIT_Error
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_EnableIT_Error(SPI_Type *SPIx)
  {
    SET_BIT(SPIx->IER, SPI_IER_ERRIE_Msk);
  }

  /**
   * @brief    Get SPI Error Interrupt Enable Status
   * @rmtoll   IER    ERRIE    FL_SPI_IsEnabledIT_Error
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsEnabledIT_Error(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->IER, SPI_IER_ERRIE_Msk) == SPI_IER_ERRIE_Msk);
  }

  /**
   * @brief    Disable SPI Transmit Buffer Empty Interrupt
   * @rmtoll   IER    TXBEIE    FL_SPI_DisableIT_TXBufferEmptyComplete
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_DisableIT_TXBufferEmptyComplete(SPI_Type *SPIx)
  {
    CLEAR_BIT(SPIx->IER, SPI_IER_TXBEIE_Msk);
  }

  /**
   * @brief    Enable SPI Transmit Buffer Empty Interrupt
   * @rmtoll   IER    TXBEIE    FL_SPI_EnableIT_TXBufferEmptyComplete
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_EnableIT_TXBufferEmptyComplete(SPI_Type *SPIx)
  {
    SET_BIT(SPIx->IER, SPI_IER_TXBEIE_Msk);
  }

  /**
   * @brief    Get SPI Transmit Buffer Empty Interrupt Enable Status
   * @rmtoll   IER    TXBEIE    FL_SPI_IsEnabledIT_TXBufferEmptyComplete
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsEnabledIT_TXBufferEmptyComplete(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->IER, SPI_IER_TXBEIE_Msk) == SPI_IER_TXBEIE_Msk);
  }

  /**
   * @brief    Disable SPI Receive Complete Interrupt
   * @rmtoll   IER    RXIE    FL_SPI_DisableIT_RXComplete
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_DisableIT_RXComplete(SPI_Type *SPIx)
  {
    CLEAR_BIT(SPIx->IER, SPI_IER_RXIE_Msk);
  }

  /**
   * @brief    Enable SPI Receive Complete Interrupt
   * @rmtoll   IER    RXIE    FL_SPI_EnableIT_RXComplete
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_EnableIT_RXComplete(SPI_Type *SPIx)
  {
    SET_BIT(SPIx->IER, SPI_IER_RXIE_Msk);
  }

  /**
   * @brief    Get SPI Receive Complete Interrupt Enable Status
   * @rmtoll   IER    RXIE    FL_SPI_IsEnabledIT_RXComplete
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsEnabledIT_RXComplete(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->IER, SPI_IER_RXIE_Msk) == SPI_IER_RXIE_Msk);
  }

  /**
   * @brief    Set SPI Output Data/Command Under Half-Duplex Mode
   * @rmtoll   ISR    DCN_TX    FL_SPI_SetFrameMode
   * @param    SPIx SPI instance
   * @param    mode This parameter can be one of the following values:
   *           @arg @ref FL_SPI_FRAME_MODE_CMD
   *           @arg @ref FL_SPI_FRAME_MODE_DATA
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetFrameMode(SPI_Type *SPIx, uint32_t mode)
  {
    MODIFY_REG(SPIx->ISR, SPI_ISR_DCN_TX_Msk, mode);
  }

  /**
   * @brief    Get SPI Output Data/Command Under Half-Duplex Mode Setting
   * @rmtoll   ISR    DCN_TX    FL_SPI_GetFrameMode
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_FRAME_MODE_CMD
   *           @arg @ref FL_SPI_FRAME_MODE_DATA
   */
  __STATIC_INLINE uint32_t FL_SPI_GetFrameMode(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_DCN_TX_Msk));
  }

  /**
   * @brief    Get SPI Receive Collision Flag
   * @rmtoll   ISR    RXCOL    FL_SPI_IsActiveFlag_RXBuffOverflow
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_RXBuffOverflow(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_RXCOL_Msk) == (SPI_ISR_RXCOL_Msk));
  }

  /**
   * @brief    Clear SPI Receive Collision Flag
   * @rmtoll   ISR    RXCOL    FL_SPI_ClearFlag_RXBuffOverflow
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_ClearFlag_RXBuffOverflow(SPI_Type *SPIx)
  {
    WRITE_REG(SPIx->ISR, SPI_ISR_RXCOL_Msk);
  }

  /**
   * @brief    Get SPI Transmit Collision Flag
   * @rmtoll   ISR    TXCOL    FL_SPI_IsActiveFlag_TXBuffOverflow
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_TXBuffOverflow(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_TXCOL_Msk) == (SPI_ISR_TXCOL_Msk));
  }

  /**
   * @brief    Clear SPI Transmit Collision Flag
   * @rmtoll   ISR    TXCOL    FL_SPI_ClearFlag_TXBuffOverflow
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_ClearFlag_TXBuffOverflow(SPI_Type *SPIx)
  {
    WRITE_REG(SPIx->ISR, SPI_ISR_TXCOL_Msk);
  }

  /**
   * @brief    Get SPI Busy Flag
   * @rmtoll   ISR    BUSY    FL_SPI_IsActiveFlag_Busy
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_Busy(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_BUSY_Msk) == (SPI_ISR_BUSY_Msk));
  }

  /**
   * @brief    Get SPI Vocal Tract Flag
   * @rmtoll   ISR    CHSIDE    FL_I2S_GetVocalTract
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_VOCAL_TRACT_LEFT
   *           @arg @ref FL_SPI_VOCAL_TRACT_RIGHT
   */
  __STATIC_INLINE uint32_t FL_SPI_GetVocalTract(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_CHSIDE_Msk));
  }

  /**
   * @brief    Get SPI Master Error Flag
   * @rmtoll   ISR    MERR    FL_SPI_IsActiveFlag_MasterError
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_MasterError(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_MERR_Msk) == (SPI_ISR_MERR_Msk));
  }

  /**
   * @brief    Get SPI Slave Error Flag
   * @rmtoll   ISR    SERR    FL_SPI_IsActiveFlag_SlaveError
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_SlaveError(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_SERR_Msk) == (SPI_ISR_SERR_Msk));
  }

  /**
   * @brief    Get SPI Slave SSN Rise Flag
   * @rmtoll   ISR    SSNR    FL_SPI_IsActiveFlag_SlaveSSNRise
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_SlaveSSNRise(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_SSNR_Msk) == (SPI_ISR_SSNR_Msk));
  }

  /**
   * @brief    Clear SPI Slave SSN Rise Flag
   * @rmtoll   ISR    SSNR    FL_SPI_ClearFlag_SlaveSSNRise
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_ClearFlag_SlaveSSNRise(SPI_Type *SPIx)
  {
    WRITE_REG(SPIx->ISR, SPI_ISR_SSNR_Msk);
  }

  /**
   * @brief    Get SPI Slave SSN Fall Flag
   * @rmtoll   ISR    SSNF    FL_SPI_IsActiveFlag_SlaveSSNFall
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_SlaveSSNFall(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_SSNF_Msk) == (SPI_ISR_SSNF_Msk));
  }

  /**
   * @brief    Clear SPI Slave SSN Fall Flag
   * @rmtoll   ISR    SSNF    FL_SPI_ClearFlag_SlaveSSNFall
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_ClearFlag_SlaveSSNFall(SPI_Type *SPIx)
  {
    WRITE_REG(SPIx->ISR, SPI_ISR_SSNF_Msk);
  }

  /**
   * @brief    Get SPI TX Shift Empty Flag
   * @rmtoll   ISR    TXSE    FL_SPI_IsActiveFlag_TXShiftEmpty
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_TXShiftEmpty(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_TXSE_Msk) == (SPI_ISR_TXSE_Msk));
  }

